In [1]:
import numpy as np
import pandas as pd

## DataFrame

In [2]:
data = np.random.randn(4,3)

In [3]:
data

array([[-0.64603488,  0.46186417,  1.21608894],
       [ 0.34713044,  0.77652546, -1.71922586],
       [ 0.23980681, -1.5179044 ,  0.11042563],
       [ 1.74240757, -1.22019459, -0.5911252 ]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
type(dataFrame[0])

pandas.core.series.Series

In [6]:
dataFrame

          0         1         2
0 -0.646035  0.461864  1.216089
1  0.347130  0.776525 -1.719226
2  0.239807 -1.517904  0.110426
3  1.742408 -1.220195 -0.591125

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["Atakan","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

# DataFrame(data,index,colums) şeklinde bir prototype e sahiptir.

In [8]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [10]:
yeniDataFrame["Yas"]

Atakan    0.461864
Zeynep    0.776525
Atlas    -1.517904
Mehmet   -1.220195
Name: Yas, dtype: float64

In [11]:
yeniDataFrame["Calisma Saati"]

Atakan    1.216089
Zeynep   -1.719226
Atlas     0.110426
Mehmet   -0.591125
Name: Calisma Saati, dtype: float64

In [12]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atakan -0.646035  0.461864
Zeynep  0.347130  0.776525
Atlas   0.239807 -1.517904
Mehmet  1.742408 -1.220195

In [16]:
#belli bir sırayı seçmek  #Loc = locationdan geliyor ve belli bir satırı almak için kullanılır.
yeniDataFrame.loc["Atakan"]

Maas            -0.646035
Yas              0.461864
Calisma Saati    1.216089
Name: Atakan, dtype: float64

In [17]:
yeniDataFrame.loc["Atlas"]

Maas             0.239807
Yas             -1.517904
Calisma Saati    0.110426
Name: Atlas, dtype: float64

In [22]:
yeniDataFrame.iloc[1] # iloc ise index bazlı değerleri getirmek için kullanılan yöntem

Maas             0.347130
Yas              0.776525
Calisma Saati   -1.719226
Name: Zeynep, dtype: float64

In [24]:
yeniDataFrame["Maas"]

Atakan   -0.646035
Zeynep    0.347130
Atlas     0.239807
Mehmet    1.742408
Name: Maas, dtype: float64

In [25]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"] #yeni bir kolon eklenebilir.

In [26]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atakan -0.646035  0.461864       1.216089        0.923728
Zeynep  0.347130  0.776525      -1.719226        1.553051
Atlas   0.239807 -1.517904       0.110426       -3.035809
Mehmet  1.742408 -1.220195      -0.591125       -2.440389

In [28]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1) #Kolon silmek istediğimde axis yani x ekseni 1 olarak tanımlanır.

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [30]:
yeniDataFrame.drop("Mehmet",axis = 0) #Satır silmek istediğimde axis 0 dir tanımalnması zorunlu değildir.

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atakan -0.646035  0.461864       1.216089        0.923728
Zeynep  0.347130  0.776525      -1.719226        1.553051
Atlas   0.239807 -1.517904       0.110426       -3.035809

In [31]:
yeniDataFrame  #Silinmemiş gibi geldi çünkü burada fonksiyon bu şekilde yazılmış. Hazırda olan bir şeyi tam
                # tam anlamıyle değiştirmek istersek özel olarak belirtmemiz gerekiyor.

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atakan -0.646035  0.461864       1.216089        0.923728
Zeynep  0.347130  0.776525      -1.719226        1.553051
Atlas   0.239807 -1.517904       0.110426       -3.035809
Mehmet  1.742408 -1.220195      -0.591125       -2.440389

In [32]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1, inplace=True) # inplace bulunan alanın içerisinde gerçekten bu

In [33]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [35]:
yeniDataFrame.loc["Atakan"]["Maas"]

-0.6460348821839063

In [36]:
yeniDataFrame.loc["Atlas","Yas"]

-1.517904403641145

In [38]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [41]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati
Atakan   True  False          False
Zeynep  False  False           True
Atlas   False   True          False
Mehmet  False   True           True

In [42]:
booleanFrame = yeniDataFrame < 0

In [43]:
booleanFrame

         Maas    Yas  Calisma Saati
Atakan   True  False          False
Zeynep  False  False           True
Atlas   False   True          False
Mehmet  False   True           True

In [44]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atakan -0.646035       NaN            NaN
Zeynep       NaN       NaN      -1.719226
Atlas        NaN -1.517904            NaN
Mehmet       NaN -1.220195      -0.591125

In [45]:
yeniDataFrame[yeniDataFrame < 0 ]

            Maas       Yas  Calisma Saati
Atakan -0.646035       NaN            NaN
Zeynep       NaN       NaN      -1.719226
Atlas        NaN -1.517904            NaN
Mehmet       NaN -1.220195      -0.591125

In [47]:
yeniDataFrame["Yas"] > 0

Atakan     True
Zeynep     True
Atlas     False
Mehmet    False
Name: Yas, dtype: bool

In [49]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] # sadece yas 0 dan büyük olanları frame içerisinden gösterir.

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226

In [51]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [53]:
#index resetleme ve kaydetme işlemi ONEMLİ!!! değişim yok inplace olmadığı için 

yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0  Atakan -0.646035  0.461864       1.216089
1  Zeynep  0.347130  0.776525      -1.719226
2   Atlas  0.239807 -1.517904       0.110426
3  Mehmet  1.742408 -1.220195      -0.591125

In [54]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atakan -0.646035  0.461864       1.216089
Zeynep  0.347130  0.776525      -1.719226
Atlas   0.239807 -1.517904       0.110426
Mehmet  1.742408 -1.220195      -0.591125

In [55]:
# tamamne değiştirmek istersek 

yeniIndexListesi = ["Ata","Zey","Atl","Meh"]

In [57]:
yeniDataFrame["Yeni Index"] = yeniIndexListesi

In [58]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Index
Atakan -0.646035  0.461864       1.216089        Ata
Zeynep  0.347130  0.776525      -1.719226        Zey
Atlas   0.239807 -1.517904       0.110426        Atl
Mehmet  1.742408 -1.220195      -0.591125        Meh

In [60]:
yeniDataFrame.set_index("Yeni Index",inplace = True)   #set_index ayarla demek ve bu şekilde halledebiliyoruz.

In [61]:
yeniDataFrame

                Maas       Yas  Calisma Saati
Yeni Index
Ata        -0.646035  0.461864       1.216089
Zey         0.347130  0.776525      -1.719226
Atl         0.239807 -1.517904       0.110426
Meh         1.742408 -1.220195      -0.591125

In [62]:
yeniDataFrame.loc["Ata"]

Maas            -0.646035
Yas              0.461864
Calisma Saati    1.216089
Name: Ata, dtype: float64

## Multi Index

In [63]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"] # Dış indeksler

In [64]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [65]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [66]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [67]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [68]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [71]:
benimCizgiFilmListem = [[40,"a"],[30,"b"],[10,"c"],[9,"D"],[10,"e"],[11,"f"]]

In [72]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [73]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index = birlesmisIndeks,columns = ["Yas", "Meslek"])

In [74]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      a
           Bart     30      b
           Marge    10      c
South Park Cartman   9      D
           Kenny    10      e
           Kyle     11      f

In [75]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      a
Bart   30      b
Marge  10      c

In [77]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     e
Name: Kenny, dtype: object

In [78]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      a
           Bart     30      b
           Marge    10      c
South Park Cartman   9      D
           Kenny    10      e
           Kyle     11      f

In [79]:
cizgiFilmDataFrame.index.names = ["Film Adi", "İsim"]

In [80]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adi   İsim
Simpson    Homer    40      a
           Bart     30      b
           Marge    10      c
South Park Cartman   9      D
           Kenny    10      e
           Kyle     11      f